{
    "web": [
        {
            "big_image": "/images/portfolio/CMP_big.png",
            "contact": "Kathy McDaniel",
            "content": [
                {
                    "image": "/images/portfolio/CMP_logo.png",
                    "position": "right",
                    "p": "I was originally hired at Centurion to skin an implementation of Sitecore CMS for their corporate website. After some time examining the needs of the business and the cost of using it, an alternative CMS was decided upon. <a href=\"//umbraco.com\">Umbraco</a> was a designer's dream to work with. Creating a skin/theme from the ground up was easy as could be expected; simply create the master-pages and CSS and off you are."
                },
                {
                    "image": "/images/portfolio/CMP_site_thumbnail.png",
                    "position": "left",
                    "p": "The website held a number of opportunities for me to learn about writing jQuery plugins for: content and image rotators, DOM animation and manipulation, library integration, and AJAX requests. I was the sole UI developer and I worked with a dedicated back-end .Net developer which worked out nicely. One other main skill picked up while working on this project is CMS basics; prior to this I had no experience working in a <acronym title=\"Out of the box\">OOTB</acronym> CMS solution."
                }
            ],
            "preview": "/images/portfolio/CMP_home.png",
            "project": "Centurion Medical Products",
            "quote": "",
            "summary": "",
            "url": "//www.centurionmp.com"
        },
        {
            "big_image": "/images/portfolio/SGP_big.png",
            "contact": "Phil Lamoureux",
            "content": [
                {
                    "image": "/images/portfolio/SGP_logo.png",
                    "position": "right",
                    "p": "The Student Greenhouse Project was the first website I redesigned and built on my own. That site was built with Dreamweaver MX, using page templates and various other evil software specific technologies. The site lasted a good long time being maintained by the people of SGP, but finally had become too unwieldy to change."
                },
                {
                    "image": "/images/portfolio/SGP_site_thumbnail.png",
                    "position": "left",
                    "p": "I began with an idea I had been kicking around in my head for a few years without situation to use it. I would create a way for each page to call a builder script that would allow all source files to be plain HTML. This way the pages that would be edited would be simple to understand and therefore maintain; and the site would also have some power to handle: master template for site layout, CSS (w/variables) + minification, HTML5, jQuery, etc."
                }
            ],
            "preview": "/images/portfolio/SGP_home.png",
            "project": "Student Greenhouse Project",
            "quote": "",
            "summary": "",
            "url": "//sgp.msu.edu"
        },
        {
            "big_image": "/images/portfolio/AIB_big.png",
            "contact": "Tunga Kiyak",
            "content": [
                {
                    "image": "/images/portfolio/AIB_logo.png",
                    "position": "right",
                    "p": "The Academy of International Business was the very first website I ever designed, and oddly enough, my first draft of the design was accepted. As the project matured, and more requirements were realized, more artistic elements were added but my original design remained intact."
                },
                {
                    "p": "My personal design sense has changed quite a lot since I created that design sometime in the years 2003-2004; but I think that the design has held up considerably well given my complete lack of web-technology knowledge at the time."
                },
                {
                    "image": "/images/portfolio/AIB_site_thumbnail.png",
                    "position": "left",
                    "p": "I tried to create a visually appealing interface that would not be overly complicated due to its depth of content. I wanted the user interface pieces to blend with the elements around them so that over time the users would begin to recognize the site, as a whole, even from far away or at a glance."
                },
                {
                    "p": "I have kept a screenshot of the <a href='/images/portfolio/AIB_logos.png' rel='Imagezoom' title=''>AIB logos page</a> I created as documentation for proper branding if the <a href='//aib.msu.edu/logos.asp' title='AIB logos official use documentation'>original page</a> ever goes offline."
                }
            ],
            "preview": "/images/portfolio/AIB_01.png",
            "project": "Academy of International Business",
            "quote": "",
            "summary": "",
            "url": "//aib.msu.edu"
        },
        {
            "big_image": "/images/portfolio/globalEDGE_big.png",
            "contact": "Irem Kiyak",
            "content": [
                {
                    "image": "/images/portfolio/globalEDGE_logo.png",
                    "position": "right",
                    "p": "Working on globalEDGE turned into the primary focus of my career while working for the International Business Center. The website was a huge project with students working on adding content daily through a home-grown CMS. After years of development changing the look and feel of the site became required; with the change of the look came the opportunity to redefine the data storage as well."
                },
                {
                    "image": "/images/portfolio/globalEDGE_site_thumbnail.png",
                    "position": "left",
                    "p": "The old database was set up fairly flat and only partially relationally; with the new structure we wanted to create more flexibility in how data would relate to other data we kept. Moving from the old structure to the new, reduced the number of tables on the server from 300 to 70 (these numbers are approximations only but reflect the size and scope) while creating far more options for future augmentation of how the data would be used."
                },
                {
                    "p": "I have kept a screenshot of the <a href='/images/portfolio/globalEDGE_logos.png' rel='Imagezoom' title=''>globalEDGE logos page</a> I created as documentation for proper branding if the <a href='//globaledge.msu.edu/logos.asp' title='globalEDGE logos official use documentation'>original page</a> ever goes offline."
                }
            ],
            "preview": "/images/portfolio/globalEDGE_01.png",
            "project": "globalEDGE.msu.edu",
            "quote": "",
            "summary": "",
            "url": "//globalEDGE.msu.edu"
        },
        {
            "contact": "",
            "content": [
                {
                    "p": "<a href='/images/portfolio/globalEDGE_DiagTools_Splash1.png' rel='Imagezoom' title=''><img alt='screenshot of DiagnosticTools' class='image_left' src='/images/portfolio/globalEDGE_DiagTools_Splash1.png' width='180px' /></a>CIBER developed a suite of tools for education and evaluation of business environments. The interface was simply a wizard that steps the user through a series of multiple-choice questions. At the end of the questions the answers, compiled together, illuminate strengths and weaknesses with various data visualizations."
                },
                {
                    "p": "<a href='/images/portfolio/globalEDGE_DiagTools_Splash2.png' rel='Imagezoom' title=''><img alt='screenshot of DiagnosticTools' class='image_right' src='/images/portfolio/globalEDGE_DiagTools_Splash2.png' width='180px' /></a>Because these tools were fairly isolated in their scope in relation to user-base, redesigns could be done easily and quickly. I tried to up to complete redesigns whenever there were lulls in the development demand. I don't know that these designs ever made their way into production but I wish they had. The <a href='/images/portfolio/globalEDGE_DiagTools_Splash0.png' rel='Imagezoom' title='original DiagnosticTools design'>original design</a> was something that always seemed a flat and dated."
                }
            ],
            "documents": [
            ],
            "preview": "/images/portfolio/globalEDGE_Splash1.png",
            "project": "globalEDGE.msu.edu",
            "summary": "",
            "url": "//globalEDGE.msu.edu"
        }
    ],
    
    "graphics": [
        {
            "contact": "",
            "content": [
                {
                    "p": "Frequently globalEDGE would run advertisements in various publication they were affiliated with. Publication size was generally a full page due to the close relationship with the organizations involved; however, sometimes half and quarter page ads were used but they were simply pared down versions of the original."
                },
                {
                    "image": "/images/portfolio/globalEDGE_logo.png",
                    "position": "right",
                    "p": "The advertisements went through some evolution during my time as graphic designer at the International Business Center but here are some examples of what they looked like when I was still there."
                }
            ],
            "documents": [
                "/images/portfolio/globalEDGE_ad.pdf",
                "/images/portfolio/globalEDGE_diagnostic_tools_ad.pdf",
                "/images/portfolio/globalEDGE_academy_ad.pdf"
            ],
            "preview": "/images/portfolio/globalEDGE_ad.png",
            "project": "globalEDGE.msu.edu",
            "summary": "",
            "url": "//globalEDGE.msu.edu"
        },
        {
            "big_image": "/images/portfolio/AIB_big_banner.png",
            "contact": "",
            "content": [
                {
                    "image": "/images/portfolio/AIB_logo.png",
                    "position": "right",
                    "p": "For the 2006 AIB annual conference in China the host institution had an enormous stage where a large banner would fit nicely and provide a highly visible location to display logos for the various conference sponsors. This was a lot of fun because of its magnitude; if I remember correctly the width of the finished banner was 40 feet across."
                }
            ],
            "documents": [
                "/images/portfolio/AIB_BackgroundBoard_small.pdf"
            ],
            "preview": "/images/portfolio/AIB_BackgroundBoard_small.png",
            "project": "Academy of International Business",
            "summary": "",
            "url": "//aib.msu.edu"
        },
        {
            "contact": "",
            "content": [
                {
                    "image": "/images/portfolio/CIBER_logo.png",
                    "position": "right",
                    "p": "The Center for International Business Education and Research at Michigan State University is one of 30+ government funded research centers around the nation. Every 2 years they must submit a proposal for funds to the U.S. government for the Business and International Education (BIE) grant."
                },
                {
                    "image": "/images/portfolio/CIBER_GrantCover_art.png",
                    "position": "left",
                    "p": "I was charged with making the end result pretty; I did not write the proposal. I designed the cover for the proposal which you can see here and worked as art director on the project. I edited formatting in the document and kept the content flowing between sections consistent and aesthetically pleasing. There were some charts, graphs, and diagrams that I added a little style to."
                },
                {
                    "p": "I'm sure that the proposal would have been accepted and approved even without my contributions but I was happy to participate and contribute to the successful grant proposal anyway."
                }
            ],
            "documents": [
                "/images/portfolio/CIBER_GrantCover.pdf"
            ],
            "preview": "/images/portfolio/CIBER_GrantCover.png",
            "project": "Center for International Business Education and Research",
            "summary": "",
            "url": "//CIBER.msu.edu"
        },
        {
            "contact": "",
            "content": [
                {
                    "image": "/images/portfolio/IBC_logo.png",
                    "position": "right",
                    "p": "Designing brochures was a fun departure from websites, so when a new brochure was needed or it was time to edit previous years' I enjoyed the alternate work. I loved searching through photos from students' trips to put in the brochure each year. I also challenged myself each year to make the incorporation of the photos on the cover and back different than those of the years before; had I stayed working there longer I might have run into a problem with overcoming that challenge."
                }
            ],
            "documents": [
                "/images/portfolio/IBC_IB_Specialization.pdf",
                "/images/portfolio/CIBER_StudyAbroad_2005.pdf",
                "/images/portfolio/CIBER_StudyAbroad_2006.pdf",
                "/images/portfolio/CIBER_StudyAbroad_2007.pdf"
            ],
            "preview": "/images/portfolio/CIBER_StudyAbroad.png",
            "project": "International Business Center",
            "summary": "",
            "url": "//ibc.msu.edu"
        },
        {
            "contact": "",
            "content": [
                {
                    "image": "/images/portfolio/AIB_logo.png",
                    "position": "right",
                    "p": "The supervisors and administrators of AIB had a firm commitment to the branding of AIB; continually enforcing, perpetuating, and protecting the brand for the integrity of the organization. I drew up a simple graphic to go along with the logo on many different deliverables over the years; here are a few examples of that work in use."
                }
            ],
            "documents": [
                "/images/portfolio/AIB_cd_envelope.pdf",
                "/images/portfolio/AIB_cd_label.pdf",
                "/images/portfolio/AIB_mail_pack.pdf"
            ],
            "preview": "/images/portfolio/AIB_Branding.png",
            "project": "Academy of International Business",
            "summary": "",
            "url": "//aib.msu.edu"
        },
        {
            "contact": "",
            "content": [
                {
                    "image": "/images/portfolio/IBC_logo_archive_thmb.png",
                    "position": "right",
                    "p": "When IBC went through a re-branding phase I had a chance to work on logos for the identity. This is a capture of <a href='/images/portfolio/IBC_logo_archive.png' rel='Imagezoom' title=''>my workshop file</a> when I was done working on the brand. I started off slow and boring but I think it ended nice. I can't, however, defend some of the logos as they remind me on road-side hotel/motel signs; I'm so glad that none of those were chosen for the final."
                }
            ],
            "documents": [
            ],
            "preview": "/images/portfolio/IBC_logo_archive.png",
            "project": "International Business Center",
            "summary": "",
            "url": "//ibc.msu.edu"
        }
    ]
}